from flask import Flask
import random

app = Flask(__name__)

@app.route("/")
def hello_world():
    return '<h1>Hello, World!</h1> <a href = "/rastgele_gercek"> Rastgele Gerçek Gör </a> <h2> Güçlü Şifre </h2> <a href = "/sifre_olusturucu"> Şifre Oluştur </a> <h3> Yazı Tura </h3> <a href ="/Yazi_tura"> Yazı Tura Oyna </a>  <h3> Emoji Oluşturucu </h3> <a href ="/Emoji_olusturucu"> Emoji Oluştur </a>'
ogeler = [
    '+-$#!@&<>/?=%','*@&$#?=!<>+/^','<>$@&!=+-#!/?','#?=/<$@&*!>+-', 
    '&$#?=+@<>/*!?','!@#?=+-&*/$<>','/?$#=+@!<>*&-','+@-$#!<>*/?=&',
    '=+-#$!&<>*@?/','*&/#!$@?+=<>-','#@?!<>=+-$&/*','@!$<+*>-=&/?#',
    '?/$#@!<+>=&*-','&@!#$?=<>-+/^','$?!&<>=+@/*#-','/?=+<$@!#*&>-',
    '=<$&@?*#+-/>!','?@-#^$!<>/=&*','@+$!=?<*#/>&-','/#@!^=+<>$*&?',
    '^$@!+?=<>#&*/-','&$!?<+@#*^-/=>','@*#!^&+<$>=/?-','=+@$/?*#^!&<>-',
    '^<@&$*!?>=#+/-','*$@?^!<=>+&/-#','=+<>!$#^&/@?-*','^*!$/@?&<>=#-+',
    '#*!&@?=/<+^>$-','&^$?+!@/=<>#*-','@$!&?^/<>=#+*-','^$@!+?=<>#&*/-',
    '+*$?!^&/@<>#=-','!^@&$+?/#<>*=-','?<$*+!&@/=^#>-','&^$/!@+<>*?#=-',
    '+*$?!^&/@<>#=-','!^@&$+?/#<>*=-','?<$*+!&@/=^#>-','&^$/!@+<>*?#=-',
    '!^@$&?+*#/=<>-','@&+?$^*!#=<^/-','+$/@^?!#&*<>-=','?!^$@+&/#=*<>-',
    '^*&@!?/<$+=#-=','#+&@*?$!=^/<>=','$*+@?&/^#!=<>-','@!^$+*&/?=<>#-',
    '?^!+$/&@=<*>-#','!&$?^@/+<>*#=-','$^@*!&/?+<>=#-','^&?$+!@*<>/=#-',
    '*!$@&?^+/=#<>-','!@^$&*?+<>/#=-','@&^$*!+/=<>?#','?$+@&*!/<^#=-',
    '$!?^&@+/<>=*#','@^$+!/?*<&>=#','+^&$!@?*<>=#/','?*^+$/!&@=<#>',
    '&@$*!^/?=+<>#','@!^$?&/+<>=*#','&+*^$@!/?=<#>','^$@!?*&/<>=+#',
    '@+&^$!*/?=<#','*^$@!+&/?<>=#','@$*?^+&/<!>=#','+^$@!&*?<>=/#',
    '?^$+@/&*!<>=#','+^&$!@/?*<>=#','@+&^$!/?*<>=#','&^$@+!?*/<>=#',
    '!@^&$*+/?=<#>','@$*!^+&/?<>=#','+^$@!&*?/<>=#','@+^&$*!/?<>=#',
    '&@^$+!?*/<>=#','@+&^$!*/?=<#>','^$@+!?&*/<>=#','*$^@!?&/+<>=#-',
    '+$?^@&*!/<>#=-','@*&^$+!?/<>#=-','^+@$!?&*/<>=#-','&^$@*!/?+=<>#-',
    '@!^+&$?*/<>#=-','?^$*@+!/&=<#>-','+$^@!&*?/<>#=-','@&^*!+$/<>?=#-',
    '^@$!?*&+/<>#=-','!*&^$@+/?<>#=-','+@^&*!$/?<>#=-','&^$@!?*+/<>#=-',
    '@$^*!&+/?<>#=-','+^@$*!&/?<>#=-','!@^&$*+/?<>#=-','&^$@!?+*/<>#=-',
    '@!^&*+$/?<>#=-','^@$!&*+/?<>#=-','+^$!@*&/?<>#=-','@!^$*&+/?<>#=-',
    '?^@$*!&+/<>#=-','+&^$@*!/?<>#=-','^$@!&*+/?<>#=-','+^@$!*&/?<>#=-',
    '+^&*!@$/?<>#=-','!@^$*&+/?<>#=-','@^&*!+$/?<>#=-','!^$@*&+/?<>#=-',
    '@$^!&*+/?<>#=-','&^@!?*$+/<>#=-','&^$!?@*+/<>#=-','@$^*!+&/?<>#=-',
    '!^@$*&+/?<>#=-','@^$*!&+/?<>#=-','+^$!@*&/?<>#=-','!@^$&*+/?<>#=-',
    '&^$!@*+/<>#=-','&^$@!?*+/<>#=-','@$^*!&+/?<>#=-','+^@$!&*?/<>#=-',
    '@&^*!+$/<>?=#-','^@$!?*&+/<>#=-','!*&^$@+/?<>#=-','+@^&*!$/?<>#=-',
    '&^$@!?*+/<>#=-','@$^*!&+/?<>#=-','+^@$*!&/?<>#=-','!@^&$*+/?<>#=-',
    '&^$@!?+*/<>#=-','@!^&*+$/?<>#=-','?^@$*!&+/<>#=-','+^&*!@$/?<>#=-',
    '@$^!&*+/?<>#=-','!^@$*&+/?<>#=-','&^$!@*+/<>#=-','^@$!&*+/?<>#=-',
    '+&^$@*!/?<>#=-','!@^$*&+/?<>#=-','&^@!?*$+/<>#=-','@^$*!&+/?<>#=-',
    '+^$!@*&/?<>#=-','@!^$*&+/?<>#=-','^$@!&*+/?<>#=-','+^@$!*&/?<>#=-',
    '@^&*!+$/?<>#=-','!^$@*&+/?<>#=-','&^$!?@*+/<>#=-','@$^*!+&/?<>#=-',
    '^@*!&$?+/<>#=-','+$^&@!?*/<>#=-','@!*^$&+/?<>#=-','^$!?*@&+/<>#=-',
    '^@$!?*&+/<>#=-','+@^&*!$/?<>#=-','&^$@!?+*/<>#=-','@$^!&*+/?<>#=-',
    '+^@$*!&/?<>#=-','@!^&*+$/?<>#=-','^$@!&*+/<>#=-','!^@$*&+/?<>#=-',
    '&^$!@*+/<>#=-','@^&*!+$/<>?=#-','+^$@!*&/?<>#=-','!^&$@+*/<>#=-',
    '@$!?^&+/<>#=-','+^$!@&*?/<>#=-','@!^&*$+/<>#=-','!^$*@&+/<>#=-',
    '@$!^&*+/<>#=-','&^$@!*+/<>#=-','@^!&*+$/?<>#=-','^$@!&*+/<>#=-',
    '!^@*&$+/<>#=-','+@^$!*&/?<>#=-','@$^&*!+/<>#=-','&^$@!?+/<>#=-',
    '@!*^&$+/<>#=-','+^@$!*/<>#=-','@$!&^*+/<>#=-','&^$@!*/<>#=-',
    '@^!&*+/<>#=-','^$@!*+/<>#=-','!^@*&+/<>#=-','+^$!@*/<>#=-',
    '@^&*!+/<>#=-','&^$!@*/<>#=-','@!^&*+/<>#=-','^@$!*/<>#=-',
    '!^&*@+/<>#=-','+$@^!*/<>#=-','@!*^$/<>#=-','&^@!*/<>#=-',
    '^!@$*/<>#=-','!^&*+/<>#=-','@^!*/<>#=-'
]


rastgele_gerçek_listesi = [
"Teknolojik bağımlılıktan mustarip olan çoğu kişi, kendilerini şebeke kapsama alanı dışında bulduklarında veya cihazlarını kullanamadıkları zaman yoğun stres yaşarlar.",
"2018 yılında yapılan bir araştırmaya göre 18-34 yaş arası kişilerin %50'den fazlası kendilerini akıllı telefonlarına bağımlı olarak görüyor.",

"Teknolojik bağımlılık çalışması, modern bilimsel araştırmanın en ilgili alanlarından biridir.",
"2019'da yapılan bir araştırmaya göre, insanların %60'ından fazlası akıllı telefonlarındaki iş mesajlarına işten ayrıldıktan sonraki 15 dakika içinde yanıt veriyor.",

"Teknolojik bağımlılıkla mücadele etmenin bir yolu, zevk veren ve ruh halini iyileştiren faaliyetler aramaktır.",

"Elon Musk, sosyal ağların içeriği görüntülemek için mümkün olduğunca fazla zaman harcamamız için bizi platformun içinde tutmak üzere tasarlandığını iddia ediyor.",
"Elon Musk ayrıca sosyal ağların düzenlenmesini ve kullanıcıların kişisel verilerinin korunmasını savunmaktadır. Sosyal ağların hakkımızda büyük miktarda bilgi topladığını ve bu bilgilerin daha sonra düşüncelerimizi ve davranışlarımızı manipüle etmek için kullanılabileceğini iddia ediyor.",

"Sosyal ağların olumlu ve olumsuz yanları vardır ve bu platformları kullanırken her ikisinin de farkında olmalıyız."

]

@app.route('/rastgele_gercek')
def rastgele_gerçek():
    return f'<p>{random.choice(rastgele_gerçek_listesi)}</p>'

@app.route('/sifre_olusturucu')
def sifre_olusturucu():
    return f'<p>{random.choice(ogeler)}</p>'

@app.route('/Yazi_tura')
def yazi_tura():
    para = random.randint(0, 2)
    if para == 0:
        return "YAZI"
    else:
        return "TURA"

@app.route('/Emoji_olusturucu')
def emoji_olusturucu():
    emoji = ["\U0001f600", "\U0001f642", "\U0001F606", "\U0001F923"]
    return random.choice(emoji)

app.run(debug=True)
